code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПодтвержденияСубброкераПоРСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПодтвержденияСубброкераПоРСВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеНалоговыхЛьгот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолученияОтветаНД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорСубброкера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПодтвержденияСубброкераПоРСВ/Ext/ManagerModule.bsl
Процедура УдалитьЗаписи(КД, ДоговорСубброкера) Экспорт
	НаборЗаписей = РегистрыСведений.ПодтвержденияСубброкераПоРСВ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КД.Установить(КД);
	НаборЗаписей.Отбор.ДоговорСубброкера.Установить(ДоговорСубброкера);
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ДобавитьЗапись(КД, ПоляПодтверждения) Экспорт
	Запись = РегистрыСведений.ПодтвержденияСубброкераПоРСВ.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПоляПодтверждения);
	Запись.КД = КД;
	Запись.Записать();
КонецПроцедуры

Функция ПолученыПодтвержденияПоВсемСубброкерам(КД, ДоговорыДокумента) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.Договор КАК Договор
	|ПОМЕСТИТЬ втДоговорыДокумента
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|///////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подтверждения.ДоговорСубброкера КАК Договор
	|ПОМЕСТИТЬ втПодтвержденныеДоговоры
	|ИЗ
	|	РегистрСведений.ПодтвержденияСубброкераПоРСВ КАК Подтверждения
	|ГДЕ
	|	Подтверждения.КД = &КД
	|;
	|
	|///////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыДокумента.Договор КАК Договор
	|ИЗ
	|	втДоговорыДокумента КАК ДоговорыДокумента
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|	ПО
	|		ДоговорыКонтрагентов.Ссылка = ДоговорыДокумента.Договор
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПодтвержденныеДоговоры КАК ПодтвержденныеДоговоры
	|	ПО
	|		ДоговорыДокумента.Договор = ПодтвержденныеДоговоры.Договор
	|
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец.Субброкер
	|	И ПодтвержденныеДоговоры.Договор ЕСТЬ NULL
	|");
	Запрос.УстановитьПараметр("ТЗ", ДоговорыДокумента);
	Запрос.УстановитьПараметр("КД", КД);
	Возврат Запрос.Выполнить().Пустой();
КонецФункции

Функция ДанныеПоНалогам(КД, ЦеннаяБумага, СчетДепо, РазделСчетаДепо) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Подтверждения.Количество КАК Количество,
	|	Подтверждения.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	Подтверждения.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	Подтверждения.НалоговаяСтавка КАК НалоговаяСтавка
	|ИЗ
	|	РегистрСведений.ПодтвержденияСубброкераПоРСВ КАК Подтверждения
	|ГДЕ
	|	Подтверждения.КД = &КД
	|	И Подтверждения.ДоговорСубброкера.Владелец = &Депонент
	|	И Подтверждения.СчетДепо = &СчетДепо
	|	И Подтверждения.Субклиент = &Субклиент
	|	И Подтверждения.ЦеннаяБумага = &ЦеннаяБумага");
	Запрос.УстановитьПараметр("КД", КД);
	Запрос.УстановитьПараметр("Депонент", СчетДепо.Владелец);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("Субклиент", РазделСчетаДепо.Субклиент);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("Количество, СтатусНалогоплательщика, НаличиеНалоговыхЛьгот, НалоговаяСтавка");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	Возврат Результат;
КонецФункции
